import 'package:flutter/cupertino.dart';
import 'package:flutter/material.dart';

List<String> servicesTitles = [
  "المال",
  "الحبوب",
  "المواشي",
  "المعادن",
];
List<String> routesName = [
  "numeric",
  "agricole",
  "betail",
  "gold",
];
List<String> servicesImages = [
  "assets/money.jpg",
  "assets/agricole.webp",
  "assets/betail.jpg",
  "assets/gold.jpg",
];

List<String> ahadith = [
  "عن أبي الدرداء رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم (خمس من جاء بهن مع إيمان دخل الجنة: من حافظ على الصلوات الخمس على وضوئهن وركوعهن وسجودهن ومواقيتهن، وصام رمضان، وحج البيت إن استطاع إليه سبيلاً، وأعطى الزكاة طيبة بها نفسه)",
  "",
  ""
];
//(179, 202, 194, 1)
Color color = const Color.fromRGBO(213, 243, 253, 1);
const String apikey =
    "qo10d5s150ze66w05s4p3e4icl9bugd39hivtmk7rfwmnq2l6bgl51hrd6de"; // metal api
TextStyle style1 = const TextStyle(
    fontSize: 20,
    color: Color.fromRGBO(46, 52, 64, 1),
    fontWeight: FontWeight.bold);
TextStyle style2 = const TextStyle(
  fontSize: 16,
  color: Color.fromRGBO(46, 52, 64, 1),
);
Decoration decoration = BoxDecoration(
    border: Border.all(width: 2),
    borderRadius: const BorderRadius.all(Radius.circular(12)));

Map<String, String> massarif = const {
  "الفقير": "من لیس له من المال ما یسد حاجته وحاجة من یعول (على من ینفق).",
  "المسكين":
      "ھم الفقراء المتعفّفین الذین لا یعلم بحاجتھم إلا الله سبحانه وتعالى.",
  "العاملون عليها": "هم الذين يتولون جمع الزكاة وتوزيعها.",
  "المؤلفة قلوبهم": "ھم حدیثو عھد بالإسلام، أو الذین یرجى إسلامھم.",
  "في الرقاب": "ھم فاقدو الحریة من العبید و الأسرى.",
  "الغارمون": "هم الذين أخذوا ديونا في غير معصية الله وعجزوا عن تسديدها.",
  "في سبيل الله":
      "كل عمل فیه نفع للأمة (بناء المدارس، المستشفیات، دور الأيتام …)",
  "ابن السبيل": "هو المسافر المنقطع عن بلده وليس له مال.",
};

String conditions =
    "يُشترط في المال حتى تجب فيه الزّكاة أن يكون من الأصناف التي تجب فيها الزّكاة، وأن يبلغ المال القدر الذي أقرّه الشارع الحكيم لِتجبْ فيه الزّكاة؛ وهو النّصاب، وأن يَمرّ على وجود هذا المال مع مالكه عاماً هجرياً كاملاً، وهو ما يسمّى بحوَلان الحَول، ويختصّ هذا الشرط بزكاة الذّهب والفضة والماشية، ولا ينطبق على زكاة الزّروع والثّمار، فإن الحَول بالنسبة للزّروع والثّمار هو اكتمال نُضجها.\n"
    "\n"
    "\n"
    "يُشترط في المال الذي تجب فيه الزّكاة على وجه التّفصيل ما يأتي:\n"
    "\n"
    "\n"
    "  - كوْنه واقعاً تحت مُلك الشخّص نفسه:  لأنّ الزّكاة تمليك، ولا يمكن تمليك المال للغير إلا أن يكون الشخص مالكاً له، وبناءً على ذلك فقد ذهب الحنفية إلى القول بعدم وجوب الزّكاة في الوَقف والخَيل المسبّلة. والملكيّة التّامة المطلقة للمال؛ أي أنه يحقّ لمالك المال التّصرف فيه تصرفاً تامّاً، وكذلك الانتفاع به.\n"
    "\n"
    "  - النّماء: وذلك أنّ إحدى الغايات من مشروعية الزّكاة هي تقديم المساعدة للفقراء، بحيث لا يصير الغنيّ فقيراً مثلهم، فإن كان المال غير نامياً وأخرج المزكّي منه، فإنّه ينفد على مدى السّنوات وتكرار الإخراج.\n"
    "\n"
    "  - الزيادة على الحاجات الأصلية: وهو شرطٌ عند الحنفية، فلا زكاة في كلّ ما يُملَك من الحاجات الأساسيّة حتى لو بلغت قيمته النّصاب، ومنه أيضاً أنّه لا تجب الزّكاة في كتب العلم. حولان الحَول: بمعنى أن يبقى المال بملكِ صاحبه سَنَةً قمريّةً كاملةً، فإن لم يُتمّها فلا زكاة فيه، ويستند هذا الشرط إلى قول الرسول صلّى الله عليه وسلّم :(لا زكاةً في مالٍ حتى يحولَ عليه الحولُ).\n"
    "\n"
    "  - حولان الحَول: بمعنى أن يبقى المال بملكِ صاحبه سَنَةً قمريّةً كاملةً، فإن لم يُتمّها فلا زكاة فيه، ويستند هذا الشرط إلى قول الرسول -صلّى الله عليه وسلّم-: (لا زكاةً في مالٍ حتى يحولَ عليه الحولُ)\n"
    "\n"
    "  - بلوغ المال النّصاب: والنّصاب هو مقدارٌ حدّده الشّرع يجب أن تصل قيمة المال إليه حتى تجب فيه الزكاة، فإن كان أقلّ فلا زكاة فيه، ويختلف النّصاب باختلاف كلِّ قسمٍ من أقسام الأموال التي تجب فيها الزّكاة.\n"
    "\n"
    "  - الخُلوّ من الدَّين: فإن كان دَين المزكّي يَفوق ما بيده من المال أو مساوياً له، فليس فيه زكاة، لكن إن ارتبط الدَين بالذّمّة بعد وجوب الزّكاة على الشّخص فتبقى الزّكاة واجبةً وعلى صاحبها إخراجها.\n"
    "\n"
    "\n"
    "\n"
    "شروط صاحب المال الذي تجب فيه الزكاة:\n"
    "\n"
    "  - المسلم: فلا تجب على غير المسلم بالإجماع، وقال الشافعية بوجوب الزّكاة على المرتدّ إن حال عليها الحَول قبل ردّته، وإن حال حولها أثناء ردتّه فلا زكاة فيها، فإن عاد إلى الإسلام وبقي المال وجبت زكاتها، ودليل عدم وجوب الزكاة على غير المسلم قول الله تعالى: (وَما مَنَعَهُم أَن تُقبَلَ مِنهُم نَفَقاتُهُم إِلّا أَنَّهُم كَفَروا بِاللَّـهِ وَبِرَسولِهِ وَلا يَأتونَ الصَّلاةَ إِلّا وَهُم كُسالى وَلا يُنفِقونَ إِلّا وَهُم كارِهونَ).\n"
    "\n"
    "  - الحرّ  : فلا تجب الزكاة على العبد.\n"
    "\n"
    "  - البالغ العاقل: حيث يُشترط ذلك عند الحنفية، أمّا الجمهور فقالوا بأنّ البلوغ والعقل لا يُشترطان، فالمجنون والصّبي يُخرج وليّهما زكاة أموالهما.\n";
